# Pandas = Panel Data Sets
## Para datos multidimensionales comunes en estadística y econometría

## Sirve para manipular tablas de datos (DataFrame)

In [1]:
# importar pandas
import pandas as pd

In [5]:
# datos RRSS 2020
fb = ['Facebook', 2449, True,2006]
tw = ['Twitter', 339, False,2006]
ig = ['Instagram',1000, True,2010]
yt = ['Youtube',2000,False,2005]
lk = ['LinkedIn',663,False,2003]
wa = ['Whatsapp',1600,True,2009]

In [6]:
lista_rrss = [fb,tw,ig,yt,lk,wa]

In [9]:
# crear DataFrame a partir de listas
df_rrss = pd.DataFrame(lista_rrss, 
             columns=['Nombre','Cantidad','Pertenece a Facebook','Año'])
df_rrss

      Nombre  Cantidad  Pertenece a Facebook   Año
0   Facebook      2449                  True  2006
1    Twitter       339                 False  2006
2  Instagram      1000                  True  2010
3    Youtube      2000                 False  2005
4   LinkedIn       663                 False  2003
5   Whatsapp      1600                  True  2009

In [11]:
# crear DataFrame vacío
df_vacio = pd.DataFrame(columns=['Nombre','Cantidad','Pertenece a Facebook','Año'])
df_vacio

Empty DataFrame
Columns: [Nombre, Cantidad, Pertenece a Facebook, Año]
Index: []

## Metodo append en Pandas -> se utiliza ._append

In [17]:
df_vacio = df_vacio._append({'Nombre':'Facebook',
                            'Cantidad':2449,
                            'Pertenece a Facebook':True,
                            'Año':2006}, ignore_index=True )

In [18]:
df_vacio

     Nombre Cantidad Pertenece a Facebook   Año
0  Facebook     2449                 True  2006
1  Facebook     2449                 True  2006

# Seleccionar elementos

In [19]:
# seleccionar elementos .loc vs .iloc
df_rrss

      Nombre  Cantidad  Pertenece a Facebook   Año
0   Facebook      2449                  True  2006
1    Twitter       339                 False  2006
2  Instagram      1000                  True  2010
3    Youtube      2000                 False  2005
4   LinkedIn       663                 False  2003
5   Whatsapp      1600                  True  2009

In [20]:
# seleccionar elementos por etiquetas
# .loc -> metodo de localizacion
df_rrss.loc[1,'Nombre']

'Twitter'

In [21]:
# seleccionar elemento por numero
# .iloc -> localizacion por entero
df_rrss.iloc[1,0]

'Twitter'

In [24]:
# seleccionar por columnas
df_rrss['Nombre']

0     Facebook
1      Twitter
2    Instagram
3      Youtube
4     LinkedIn
5     Whatsapp
Name: Nombre, dtype: object

In [26]:
# seleccionar por filas
df_rrss.iloc[4]

Nombre                  LinkedIn
Cantidad                     663
Pertenece a Facebook       False
Año                         2003
Name: 4, dtype: object

In [27]:
# seleccionar por condicion booleana
df_rrss['Cantidad'] > 1500

0     True
1    False
2    False
3     True
4    False
5     True
Name: Cantidad, dtype: bool

In [28]:
df_rrss[df_rrss['Cantidad'] > 1500]

     Nombre  Cantidad  Pertenece a Facebook   Año
0  Facebook      2449                  True  2006
3   Youtube      2000                 False  2005
5  Whatsapp      1600                  True  2009

## Ordenar

Ordenar columnas

In [29]:
# ordenar de manera ascendente: de menor a mayor
df_rrss.sort_values('Nombre', ascending=True)

      Nombre  Cantidad  Pertenece a Facebook   Año
0   Facebook      2449                  True  2006
2  Instagram      1000                  True  2010
4   LinkedIn       663                 False  2003
1    Twitter       339                 False  2006
5   Whatsapp      1600                  True  2009
3    Youtube      2000                 False  2005

In [30]:
# ordenar de manera descendente: de mayor a menor
df_rrss.sort_values('Cantidad', ascending=False)

      Nombre  Cantidad  Pertenece a Facebook   Año
0   Facebook      2449                  True  2006
3    Youtube      2000                 False  2005
5   Whatsapp      1600                  True  2009
2  Instagram      1000                  True  2010
4   LinkedIn       663                 False  2003
1    Twitter       339                 False  2006

In [32]:
# Ordenar dos valores (por doble variable)
df_rrss.sort_values( ['Año','Cantidad'], ascending=[True,False] )

      Nombre  Cantidad  Pertenece a Facebook   Año
4   LinkedIn       663                 False  2003
3    Youtube      2000                 False  2005
0   Facebook      2449                  True  2006
1    Twitter       339                 False  2006
5   Whatsapp      1600                  True  2009
2  Instagram      1000                  True  2010

# Leer archivos csv, excel

In [35]:
import pandas as pd
df = pd.read_excel(r'C:\Users\dell-\Downloads\Ejemplo_df.xlsx')
df

        Pais  Poblacion    Area
0     Mexico        129  1973.0
1     Espana         46   505.0
2  Venezuela         32   916.0
3     Espana         46     NaN

In [38]:
df[["Pais","Poblacion"]]

        Pais  Poblacion
0     Mexico        129
1     Espana         46
2  Venezuela         32
3     Espana         46

In [39]:
df2=df[["Pais","Poblacion"]]

In [40]:
df2

        Pais  Poblacion
0     Mexico        129
1     Espana         46
2  Venezuela         32
3     Espana         46

In [41]:
df

        Pais  Poblacion    Area
0     Mexico        129  1973.0
1     Espana         46   505.0
2  Venezuela         32   916.0
3     Espana         46     NaN

In [42]:
df[1:3]

        Pais  Poblacion   Area
1     Espana         46  505.0
2  Venezuela         32  916.0

## Limpiar 
* Eliminar duplicados

In [43]:
df.drop_duplicates("Pais")

        Pais  Poblacion    Area
0     Mexico        129  1973.0
1     Espana         46   505.0
2  Venezuela         32   916.0

* Eliminar nan (valores que no aplican, erroneos)

In [44]:
df

        Pais  Poblacion    Area
0     Mexico        129  1973.0
1     Espana         46   505.0
2  Venezuela         32   916.0
3     Espana         46     NaN

In [45]:
df.dropna()

        Pais  Poblacion    Area
0     Mexico        129  1973.0
1     Espana         46   505.0
2  Venezuela         32   916.0

In [46]:
df

        Pais  Poblacion    Area
0     Mexico        129  1973.0
1     Espana         46   505.0
2  Venezuela         32   916.0
3     Espana         46     NaN

* Para que guarde dentro de ese mismo dataframe, el resultado sin el registro que tiene el valor erroneo

In [47]:
df.dropna(inplace=True)

In [48]:
df

        Pais  Poblacion    Area
0     Mexico        129  1973.0
1     Espana         46   505.0
2  Venezuela         32   916.0

* Para eliminar columna

In [50]:
df.drop("Area",axis=1,inplace=True)

In [51]:
df

        Pais  Poblacion
0     Mexico        129
1     Espana         46
2  Venezuela         32

* Filtrar el dataframe

In [53]:
df[df["Poblacion"]>40]

     Pais  Poblacion
0  Mexico        129
1  Espana         46

In [54]:
df

        Pais  Poblacion
0     Mexico        129
1     Espana         46
2  Venezuela         32

In [55]:
df3=df[df["Poblacion"]>40]

In [56]:
df3

     Pais  Poblacion
0  Mexico        129
1  Espana         46